driver-tests/bpelse/xslt/InOutBPXSLT/InOutCompAppProj/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsl="http://xml.netbeans.org/schema/XSLTBPSchema">
  <soapenv:Body>
    <xsl:MsgElem>
      <intElem>100</intElem>
      <strElem>Message send from test:</strElem>
    </xsl:MsgElem>
  </soapenv:Body>
</soapenv:Envelope>