driver-tests/bpelse/xslt/InOutBPXSLT/InOutCompAppProj/test/TestCase1/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <someNS:MsgElem xmlns:someNS="http://xml.netbeans.org/schema/XSLTBPSchema">
      <intElem xmlns:ns1="http://xml.netbeans.org/schema/XSLTBPSchema" xmlns="">101</intElem>
      <strElem xmlns="">Message send from test: Added in BP: Added in the XSLT: Returning to Http:</strElem>
    </someNS:MsgElem>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
